# Práctica 1: Análisis exploratorio de datos, preprocesamiento y validación de modelos de clasificación

## Minería de Datos

### Curso académico 2021-2022

#### Profesorado:

* Juan Carlos Alfaro Jiménez
* José Antonio Gámez Martín

---
#### Alumnos:
* Raúl Milla
* Juan Ibañez
---

**Notas**:

* Adaptado de las prácticas de Jacinto Arias Martínez y Enrique González Rodrigo.

---

## 1.Preliminares

Para empezar tendremos que crear la semilla e implementar las funciones que usaremos más adelante

In [2]:
from sklearn.metrics import classification_report, plot_confusion_matrix
from IPython.display import display
import pandas as pd
def fit_evaluate(estimator, X_train, X_test, y_train, y_test):
    """Fit the estimator to the training dataset and evaluate in the testing dataset."""
    # Fit the model according to the given training dataset
    estimator = estimator.fit(X_train, y_train)

    # Predict the class labels for the testing dataset
    predictions = estimator.predict(X_test)

    # Build a text report (in a dictionary) with the main classification metrics
    report = classification_report(y_test, predictions, output_dict=True)

    # Convert the dictionary to tabular data
    report = pd.DataFrame(report).T

    # Display the text report
    display(report)

    # Plot the confusion matrix for the testing dataset
    plot_confusion_matrix(estimator, X_test, y_test);

    return estimator, predictions
random_state = 27912

## 2.Acceso y almacenamiento de datos

In [6]:
data = pd.read_csv("../input/titanic/train.csv",index_col="PassengerId")

In [7]:
target = "Survived"

In [8]:
data[target] = data[target].astype("category")

In [11]:
data.sample(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
550,1,2,"Davies, Master. John Morgan Jr",male,8.0,1,1,C.A. 33112,36.7500,NaN,S
671,1,2,"Brown, Mrs. Thomas William Solomon (Elizabeth ...",female,40.0,1,1,29750,39.0000,NaN,S
639,0,3,"Panula, Mrs. Juha (Maria Emilia Ojala)",female,41.0,0,5,3101295,39.6875,NaN,S
217,1,3,"Honkanen, Miss. Eliina",female,27.0,0,0,STON/O2. 3101283,7.9250,NaN,S
722,0,3,"Jensen, Mr. Svend Lauritz",male,17.0,1,0,350048,7.0542,NaN,S

In [13]:
X=data.drop(target,axis=1)
y= data[target]

Comprobamos que efectivamente se ha hecho la separacion de manera correcta

In [14]:
X.sample(5)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
144,3,"Burke, Mr. Jeremiah",male,19.0,0,0,365222,6.7500,NaN,Q
129,3,"Peter, Miss. Anna",female,NaN,1,1,2668,22.3583,F E69,C
653,3,"Kalvik, Mr. Johannes Halvorsen",male,21.0,0,0,8475,8.4333,NaN,S
363,3,"Barbara, Mrs. (Catherine David)",female,45.0,0,1,2691,14.4542,NaN,C
716,3,"Soholt, Mr. Peter Andreas Lauritz Andersen",male,19.0,0,0,348124,7.6500,F G73,S